{
  "guid": "augu",
  "name": "Augustus Loop",
  "description": "Augustus Loop is a disting NT implementation of one of Expert Sleepers' oldest products, the VST plug-in of the same name. Essentially, it's a tape-inspired stereo delay with adjustable parameters for time, feedback, routing, and effects. The algorithm features four independent 'tape read heads', allowing for various delay configurations like straight stereo delays or ping-pong delays. It supports manual delay adjustment, tap tempo, clock input, CV control of tape speed (scaled 1V/octave), tape stop/reverse functionality, an effects loop for external processing, and a saturation/filter section. The module also includes advanced features such as inertia-free mode, bit depth selection, and detailed routing options.",
  "categories": [
    "Delay",
    "Modulation",
    "Effects",
    "Audio Processing",
    "Tape Emulation"
  ],
  "short_description": "Tape-like delay with stereo feedback paths, CV control, effects loop, and saturation/filtering.",
  "use_cases": [
    "Stereo delays (straight or ping-pong)",
    "Multi-tap delay effects",
    "CV-controlled tape speed modulation",
    "External effects processing via FX loop",
    "Saturation and filtering for warm tones"
  ],
  "gui_description": "The GUI displays feedback amount at the bottom left, delay time at the bottom right, and an animated center area indicating tape direction/speed. Clock pulses flash 'Clock', and tap tempo readiness shows as 'Tap'.",
  "specifications": [
    {
      "name": "Max Delay Time",
      "value": "44 seconds"
    },
    {
      "name": "Sample Rate Compatibility",
      "value": "Standard (NT-compatible)"
    }
  ],
  "input_ports": [
    {
      "name": "Input L",
      "description": "Left channel input for the delay module."
    },
    {
      "name": "Input R",
      "description": "Right channel input for the delay module."
    },
    {
      "name": "Pitch CV",
      "description": "CV input controlling tape speed (scaled 1V/octave)."
    },
    {
      "name": "Clock Input",
      "description": "CV clock input to synchronize delay time with external timing signals."
    }
  ],
  "output_ports": [
    {
      "name": "Output L",
      "description": "Left channel output of the processed signal."
    },
    {
      "name": "Output R",
      "description": "Right channel output of the processed signal."
    },
    {
      "name": "FX Loop Output L",
      "description": "Left channel output for external effects loop processing (when enabled)."
    },
    {
      "name": "FX Loop Output R",
      "description": "Right channel output for external effects loop processing (when enabled)."
    }
  ]
}