{
  "guid": "augu",
  "name": "Augustus Loop",
  "description": "Augustus Loop is a disting NT implementation of one of Expert Sleepers' oldest products, the VST plug-in of the same name. Essentially, it's a tape-inspired stereo delay. The delay time can be dialled in manually, or set by tap tempo or a clock input. The longest delay possible is around 44 seconds. Being a tape delay, you can change the tape speed via CV, patching an LFO into here for subtle detuning or extreme mangling effects. You can also stop and reverse the tape. There is an option to run the delay signal through an 'effects loop', allowing insertion of other effects or processing into the guts of the delay. The Pitch CV input changes the tape speed, scaled 1V/octave.",
  "categories": [
    "audio effects",
    "delay",
    "clocking",
    "routing",
    "external control",
    "CV processing"
  ],
  "short_description": "\"Tape-like delay\"",
  "specifications": [
    {
      "name": "Max Delay Time",
      "value": "1-44 seconds",
      "description": "The maximum delay time possible."
    },
    {
      "name": "Sample Rate",
      "value": "Variable (depends on NT system)",
      "description": "Supports the sample rate of the disting NT platform."
    }
  ],
  "input_ports": [
    {
      "name": "Left Input",
      "description": "Audio input for the left channel, fed to the tape write head."
    },
    {
      "name": "Right Input",
      "description": "Audio input for the right channel, fed to the tape write head."
    },
    {
      "name": "Pitch CV",
      "description": "CV input that changes the tape speed (scaled 1V/octave)."
    },
    {
      "name": "Clock Input",
      "description": "CV clock input used to set delay time based on rising edges."
    }
  ],
  "output_ports": [
    {
      "name": "Left Output",
      "description": "Audio output for the left channel, including processed delay signal."
    },
    {
      "name": "Right Output",
      "description": "Audio output for the right channel, including processed delay signal."
    }
  ]
}