{
  "guid": "btcr",
  "name": "Bit Crusher",
  "description": "This algorithm is an implementation of the disting mk4 algorithm of the same name. You may like to [review the video about that algorithm, which is here](https://www.youtube.com/watch?v=Tv5c8gPYwFs) [57] . The algorithm is a 'bit crusher' – it applies sample rate and sample depth reduction to deliberately introduce quantisation and aliasing artefacts. It also optionally applies bitwise modification of the samples for non-linear distortion effects. The ‘Bit reduce’ parameter sets the bit depth reduction. There are two types of bit reduction available: Type I – the signal is quantised to a 16 bit word, and the low bits thrown away. The resulting signal uses a power of 2 bits. Changing between bit depths is therefore discontinuous. Type II – quantisation is achieved via the limited precision of integer maths when dividing the signal by a factor. Since the factor can be continuously varied, this offers a smooth variation between 'bit depths'. Furthermore, you may choose symmetric or asymmetric bit reduction via the ‘Symmetric’ parameter. Asymmetric bit reduction treats the whole signal range as one number to be quantised. Symmetric bit reduction treats positive and negative sections of the input signal differently. Negative sections are flipped positive, quantized, and flipped back. The ‘Reduction' parameter selects the type of bit reduction. The positive and negative sections of the input signal can have different types of reduction applied. |‘Reduction’ value|Positive signal|Negative signal|---|---|---|**0**|Type I|Type I|**1**|Type II|Type II|**2**|Type I|Type II|**3**|Type II|Type I|**4**|Type I|None|**5**|Type II|None|**6**|None|Type I|**7**|None|Type II| The ‘Mangling' parameter selects the bit mangling mode. |‘Mangling’ value|Bit mangling|---|---|---|**0**|None|**1**|Bit swap variant 1|**2**|Bit swap variant 2|**3**|Bit swap variant 3|**4**|Bit rotation|**5**|Previous sample XOR variant 1|**6**|Previous sample XOR variant 2|**7**|Previous sample XOR variant 3|",
  "categories": [
    "distortion",
    "audio effects"
  ],
  "short_description": "\"Sample rate and bit depth reduction\""
}