{
  "guid": "gran",
  "name": "Granulator",
  "description": "This algorithm is an implementation of the original Granulator algorithm on the disting EX. It implements a granular synthesis engine, taking as its source material either live audio input or audio loaded from the MicroSD card. Live audio can be recorded into a buffer or streamed continuously.\n\nGranular synthesis works by playing many short snippets of sound, or 'grains', typically of the order of 100ms in length. Often various properties of the grains (e.g., their timing, length, pitch, stereo panning) are randomized to some extent.\n\nIn this algorithm, the creation ('spawning') of grains is controlled by 'notes'. Notes control when grain clouds begin and end, and affect other features such as grain pitch. Notes can be played via CV/gate pairs, MIDI, or I2C. The algorithm also offers three 'drone' voices that can simply be enabled via the parameter interface.\n\nThe display shows a waveform representation of the audio buffer with dots indicating currently playing grains. Two dotted lines represent the 'Size mean' (by separation) and 'Delay mean' (by position within the buffer). On the right, it shows current buffer size, delay, and number of grains playing.",
  "categories": [
    "Granular Synthesis",
    "Audio Effects",
    "Sampling",
    "Modulation"
  ],
  "short_description": "A granulator",
  "use_cases": [
    "Live audio recording and processing",
    "Sample playback with granular manipulation",
    "Real-time sound design using CV/MIDI/I2C control",
    "Granular synthesis for textural effects",
    "Audio effects with feedback and drones"
  ],
  "gui_description": "The display shows a waveform representation of the audio buffer, on which are superimposed dots indicating currently playing grains. The two dotted lines represent 'Size mean' (by separation) and 'Delay mean' (by position within the buffer). On the right side, it displays current buffer size, delay, and number of grains playing.",
  "specifications": [
    {
      "name": "Max buffer size",
      "value": "1-32 seconds"
    }
  ],
  "input_ports": [
    {
      "name": "Left input",
      "description": "The left audio input bus for recording or processing."
    },
    {
      "name": "Right input",
      "description": "The right audio input bus for recording or processing."
    },
    {
      "name": "Delay mean input (CV)",
      "description": "A CV input controlling the grain delay, where 5V corresponds to 100% of buffer size."
    }
  ],
  "output_ports": [
    {
      "name": "Left output",
      "description": "The left audio output bus for processed or generated signal."
    },
    {
      "name": "Right output",
      "description": "The right audio output bus for processed or generated signal."
    }
  ]
}