{
  "guid": "krby",
  "name": "Kirbinator",
  "description": "This algorithm continuously records audio into a buffer and plays slices of the buffer under the influence of various probabilities. The slices can be pitched up and down, played forwards and backwards, and panned in stereo.\n\nKey to its operation are two trigger inputs: the Mark input (defining slice boundaries) and the Trigger input (instructing playback changes). By default, behavior is random but can be made repeatable via a Random seed parameter. The algorithm supports transient detection for automatic marking, unclocked operations with adjustable play probabilities, and feedback for delay/echo effects.\n\nThe audio buffer is stereo but can operate in mono/stereo modes based on routing parameters.",
  "categories": [
    "Audio Effects",
    "Granular Synthesis",
    "Probabilistic Processing",
    "Sequencing",
    "Transient Detection"
  ],
  "short_description": "Stochastic audio processor",
  "use_cases": [
    "Rhythmic slice playback with probabilistic pitch/direction changes",
    "Automated granular synthesis via transient detection",
    "Unclocked live performance effects",
    "Feedback-based delay/echo simulations",
    "Repeatable stochastic patterns using random seeds"
  ],
  "gui_description": "Displays a waveform of the audio buffer. A short dark line shows current recording position, longer lines indicate playback positions, and checkmarks mark slice boundaries defined by the Mark input.",
  "specifications": [
    {
      "name": "Buffer size",
      "min": 1,
      "max": 0.0
    },
    {
      "name": "Sample rate",
      "description": "Standard audio sample rates supported"
    }
  ],
  "input_ports": [
    {
      "name": "Audio input (left/mono)",
      "description": "Left or mono audio signal input, selectable via routing parameters."
    },
    {
      "name": "Audio input (right)",
      "description": "Right audio signal input. Disabled if operating in mono mode."
    },
    {
      "name": "Mark",
      "description": "Trigger input defining slice boundaries in the buffer. Typically a clock but can be any signal."
    },
    {
      "name": "Trigger",
      "description": "Trigger input initiating playback changes and selecting new slices."
    },
    {
      "name": "Stop",
      "description": "Trigger input to halt current slice playback."
    },
    {
      "name": "Pitch offset CV",
      "description": "1V/octave control voltage input for dynamic pitch offset adjustments."
    }
  ],
  "output_ports": [
    {
      "name": "Audio output (left/mono)",
      "description": "Left or mono processed audio output, selectable via routing parameters."
    },
    {
      "name": "Audio output (right)",
      "description": "Right processed audio output. Disabled if operating in mono mode."
    }
  ]
}