{
  "guid": "saml",
  "name": "Sample Player (Sliced)",
  "description": "This algorithm allows you to place a number of marker points on a sample and conveniently trigger playback from the various marker points. It’s your go-to algorithm for breakbeat slicing.\n\nOnce the markers have been placed, the slices can be triggered either by MIDI notes or CV/gate. If triggering by MIDI, the ‘MIDI base note’ parameter sets the MIDI note number for slice 1. Subsequent slices are triggered by following MIDI notes (e.g., C4 for slice 2 if slice 1 is on C4). A MIDI note below the base note stops playback.\n\nIf triggering by CV/gate, a pitch CV provided to the ‘Slice input’ bus selects new slices at one semitone per step. A CV outside active slice range stops playback.\n\nA trigger signal on the ‘Advance input’ steps through slices (looping back to 1 after reaching the value set in ‘Slices’), while a trigger on the ‘Reset input’ returns to slice 1.\n\nWith a clock source and ‘Auto trigger’ enabled, the algorithm automatically loops playback, matching slice timing to tempo. The GUI displays the waveform with slices marked as check marks, showing triggered slice number, sample length in seconds/bars, and loop duration if applicable.",
  "categories": [
    "Audio",
    "Sampling",
    "Sequencing",
    "MIDI",
    "CV/Gate"
  ],
  "short_description": "Plays sliced samples",
  "use_cases": [
    "Breakbeat slicing",
    "Loop-based composition",
    "Live sampling and triggering",
    "Tempo-sync playback of segmented audio",
    "Automated slice sequencing via MIDI/CV"
  ],
  "gui_description": "The display shows the sample waveform with slices indicated as check marks above. The last triggered slice is shown as a large number in the bottom right, alongside sample length (in seconds), loop duration in bars at current tempo, and calculated loop bars if clock and ‘Auto trigger’ are enabled.",
  "specifications": [
    {
      "name": "Record time",
      "min": 0,
      "max": 60.00123456789012
    }
  ],
  "input_ports": [
    {
      "name": "Slice input",
      "description": "Pitch CV input (1V/octave) for selecting slices at one semitone per step."
    },
    {
      "name": "Trigger input",
      "description": "CV/gate trigger input to initiate slice playback."
    },
    {
      "name": "Clock input",
      "description": "Clock signal input (24 ppqn) for tempo synchronization."
    },
    {
      "name": "Run/stop input",
      "description": "Input bus for controlling sample playback start/stop."
    },
    {
      "name": "Advance input",
      "description": "Trigger input to step through slices sequentially (looping back to slice 1)."
    },
    {
      "name": "Reset input",
      "description": "Trigger input to reset playback to slice 1."
    }
  ],
  "output_ports": [
    {
      "name": "Audio output",
      "description": "Processed audio signal from the selected slice."
    }
  ]
}