{
  "guid": "vcop",
  "name": "VCO - Pulsar",
  "categories": [
    "VCO",
    "Oscillator"
  ],
  "description": "This algorithm based on the Pulsar VCO algorithm on the disting mk4. You might like to watch the video on that algorithm here^102. It is an implementation of pulsar synthesis, inspired by the description in Curtis Roads's book Microsound (MIT Press) pp137-157. In pulsar synthesis, a small grain of sound (known as a _pulsaret_ , typically a pulse or single cycle waveform) is repeated periodically, followed by a small section of silence. The length of the sound within the repeating period (equivalently, the speed at which it is played) offers a means of control the timbre without affecting the perceived pitch of the sound. By the same token, changing the fundamental pitch without changing the speed at which the grain of sound is played offers pitch change without simply shifting the entire spectrum up and down, an effect reminiscent of 'vocal' or 'formant' synthesis. There are therefore two pitch inputs:",
  "specifications": [],
  "parameters": [
    {
      "name": "Wavetable 0 Chooses the wavetable. Wave offset -100.0 100.0 0.0 % Sets the position within the wavetable. Window 0 3 0 Sets the window applied to the pulsarets: one of Rectangular, Linear attack, Linear decay, or Gaussian. Pitch mode 0 1 0 Sets whether the formant frequency is independent of the fundamental frequency or linked. Masking mode",
      "unit": "Sets",
      "minValue": 0,
      "maxValue": 1,
      "defaultValue": 0,
      "description": "the masking mode: Stochastic or Burst. Masking 0 100 0 % Sets the amount of masking. Burst length",
      "scope": "global"
    },
    {
      "name": "",
      "unit": "Sets",
      "minValue": 2,
      "maxValue": 100,
      "defaultValue": 2,
      "description": "the burst length, if the masking mode is Burst. Octave -16 8 0 Adjusts the VCO tuning in octaves. Transpose -60 60 0 ST Adjusts the VCO tuning in semitones. Fine tune -100 100 0 cents Adjusts the VCO tuning in cents.",
      "scope": "global"
    }
  ],
  "input_ports": [],
  "output_ports": []
}
